src/ChartsOfCalculationTypes/инкНачисления/инкНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>инкНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.инкНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>ВыходноеПособие</name>
      <description>Выходное пособие</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Командировка</description>
    </items>
    <items>
      <name>КомпенсацияЗаНеиспользованныйОтпуск</name>
      <description>Компенсация за неиспользованный отпуск</description>
    </items>
    <items>
      <name>МатПом217п28НК</name>
      <description>Матер. помощь ст. 217 п. 28 НК</description>
    </items>
    <items>
      <name>ОплатаДопВыходныхДляУходаЗаДетьмиИнвалидами</name>
      <description>Оплата доп. вых. для ухода за детьми инв</description>
    </items>
    <items>
      <name>ОплатаОчередныхОтпусков</name>
      <description>Оплата очередных отпусков</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оплата по основному окладу</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуЗаработку</name>
      <description>Оплата по среднему заработку</description>
    </items>
    <items>
      <name>Подарки</name>
      <description>Подарки</description>
    </items>
    <items>
      <name>ПособиеПоВремНетрудоспособностиЗаСчетРаботодателя</name>
      <description>Пос.по вр.нетрудоспособн.за сч.работодателя</description>
    </items>
    <items>
      <name>ПособиеНаПогребение</name>
      <description>Пособие на погребение</description>
    </items>
    <items>
      <name>РайонныйКоэффициент</name>
      <description>Районный коэффициент</description>
    </items>
    <items>
      <name>Сальдо</name>
      <description>Сальдо</description>
    </items>
    <items>
      <name>СевернаяНадбавка</name>
      <description>Северная надбавка</description>
    </items>
  </predefined>
  <attributes>
    <name>ФондТравматизма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ст9ФЗ212</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СевернаяНадбавка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Премия</name>
    <type>
      <types>EnumRef.инкВидыПремий</types>
    </type>
  </attributes>
  <attributes>
    <name>Отпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Налог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериальнаяПомощь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВСтаройПрограмме</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоходНДФЛ</name>
    <type>
      <types>CatalogRef.инкДоходНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>Дебет</name>
    <type>
      <types>ChartOfAccountsRef.инкХозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВычетНДФЛ</name>
    <type>
      <types>CatalogRef.инкВычетыНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Взносы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БольничныйЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходитВФОТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

src/ChartsOfCalculationTypes/инкНачисления/Forms/ФормаВидаРасчета/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСуммуВычетаНДФЛ();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходНДФЛПриИзменении(Элемент)
	
	ДоходНДФЛПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура мСуммаВычетаПриИзменении(Элемент)

	мСуммаВычетаПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВычетНДФЛПриИзменении(Элемент)
	
	ЗаполнитьСуммуВычетаНДФЛ();
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетНДФЛОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ЗаполнитьСуммуВычетаНДФЛ();
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетНДФЛНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	
	Оповещение = Новый ОписаниеОповещения("ВыборВычетНДФЛНЗавершение",ЭтотОбъект);
	
	ОткрытьФорму("Справочник.инкВычетыНДФЛ.ФормаВыбора", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетНДФЛОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ",Объект.ВычетНДФЛ);
	
	Оповещение = Новый ОписаниеОповещения("ВыборВычетНДФЛНЗавершение",ЭтотОбъект);
	
	ОткрытьФорму("Справочник.инкВычетыНДФЛ.ФормаОбъекта", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВычетНДФЛНЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт

	ЗаполнитьСуммуВычетаНДФЛ();
	
КонецПроцедуры

&НаКлиенте
Процедура Ст9ФЗ212ПриИзменении(Элемент)
	
	Если Объект.МатериальнаяПомощь И Объект.Ст9ФЗ212 Тогда
		Объект.МатериальнаяПомощь = НЕ Объект.Ст9ФЗ212;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальнаяПомощьПриИзменении(Элемент)
	
	Если Объект.МатериальнаяПомощь И Объект.Ст9ФЗ212 Тогда
    	Объект.Ст9ФЗ212  = НЕ Объект.МатериальнаяПомощь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСуммуВычетаНДФЛ()
	
	мСуммаВычета = 0;
	Если ЗначениеЗаполнено(Объект.ВычетНДФЛ) Тогда
		мСуммаВычета = Объект.ВычетНДФЛ.СуммаВычета;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДоходНДФЛПриИзмененииНаСервере()
	
	Объект.ВычетНДФЛ = Объект.ДоходНДФЛ.ВычетНДФЛ;
	
КонецПроцедуры

&НаСервере
Процедура мСуммаВычетаПриИзмененииНаСервере()

	ВычетНДФЛОбъект = Объект.ВычетНДФЛ.ПолучитьОбъект();
	ВычетНДФЛОбъект.СуммаВычета = мСуммаВычета;
	ВычетНДФЛОбъект.Записать();

КонецПроцедуры

#КонецОбласти
